Tekla.Structures.Model.Polygon
The Polygon class represents a polygon object that has its corners at the given points.

Tekla.Structures.Model.Polygon.MAX_POLYGON_POINTS
The maximum number of polygon points that is typically valid in Tekla Structures.

Tekla.Structures.Model.Polygon.MIN_POLYGON_POINTS
The minimum number of polygon points that is typically valid in Tekla Structures.

Tekla.Structures.Model.Polygon.Points
The corners of the polygon.

Tekla.Structures.Model.Polygon.#ctor
Initializes a new polygon instance with empty attributes.

Tekla.Structures.Model.Polygon.ToStruct(Tekla.Structures.ModelInternal.dotPolygon_t@)
DotPolygon:

Tekla.Structures.Model.Polygon.FromStruct(Tekla.Structures.ModelInternal.dotPolygon_t@)
DotPolygon:

Tekla.Structures.Model.Polygon.ToList(System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t}@)
Exports polygon points to the list to transfer to the core.
polygon: The polygon points.

Tekla.Structures.Model.Polygon.FromList(System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t})
Imports polygon points from the list transferred from the core.
polygon: The polygon points.